In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math as math
import random as rd
frame = pd.read_csv('mcdonalds.csv', usecols=['Item', 'Category', 'Serving Size', 'Calories', 'TotalFat'])

In [3]:
color = ['green', 'green', 'blue', 'blue', 'red', 'red', 'white']
size = ['S', 'S', 'S', 'M', 'M', 'M', 'L']
gender = ['M', 'W', 'M', 'W', 'M', 'W', 'U']
clothes = pd.DataFrame({'color': color, 'size': size, 'gender': gender})
clothes

   color size gender
0  green    S      M
1  green    S      W
2   blue    S      M
3   blue    M      W
4    red    M      M
5    red    M      W
6  white    L      U

In [5]:
clothes.color.is_unique

False

In [6]:
clothes.color.unique()

array(['green', 'blue', 'red', 'white'], dtype=object)

In [7]:
clothes.color.nunique()

4

In [9]:
clothes.loc[6, 'color'] = np.NaN
clothes

   color size gender
0  green    S      M
1  green    S      W
2   blue    S      M
3   blue    M      W
4    red    M      M
5    red    M      W
6    NaN    L      U

In [10]:
clothes.color.unique()

array(['green', 'blue', 'red', nan], dtype=object)

In [11]:
clothes.color.nunique()

3

In [13]:
len(clothes.color.unique())

4

In [14]:
clothes.color.duplicated(keep='first')

0    False
1     True
2    False
3     True
4    False
5     True
6    False
Name: color, dtype: bool

In [15]:
clothes.color.duplicated(keep='last')

0     True
1    False
2     True
3    False
4     True
5    False
6    False
Name: color, dtype: bool

In [16]:
clothes.color.duplicated(keep=False)

0     True
1     True
2     True
3     True
4     True
5     True
6    False
Name: color, dtype: bool

In [18]:
uniqueValues = clothes['color'].duplicated(keep='first')
clothes[uniqueValues]

   color size gender
1  green    S      W
3   blue    M      W
5    red    M      W

In [19]:
clothes.drop_duplicates(subset=['color'], keep='first')

   color size gender
0  green    S      M
2   blue    S      M
4    red    M      M
6    NaN    L      U

In [20]:
clothes.drop_duplicates(subset=['color', 'size'])

   color size gender
0  green    S      M
2   blue    S      M
3   blue    M      W
4    red    M      M
6    NaN    L      U

In [22]:
clothes[~clothes.duplicated(subset='color')]

   color size gender
0  green    S      M
2   blue    S      M
4    red    M      M
6    NaN    L      U

In [24]:
surveys = pd.read_csv('StackOverflowDeveloperSurvey2018.csv', usecols=['Country','Gender','OperatingSystem'], low_memory=False)
surveys.head()

          Country OperatingSystem Gender
0           Kenya     Linux-based   Male
1  United Kingdom     Linux-based   Male
2   United States             NaN    NaN
3   United States         Windows   Male
4    South Africa         Windows   Male

In [25]:
surveys.Country.is_unique

False

In [26]:
surveys.Country.unique()

array(['Kenya', 'United Kingdom', 'United States', 'South Africa',
       'Nigeria', 'India', 'Spain', 'Croatia', 'Netherlands', 'Israel',
       'Sweden', 'Chile', 'Australia', 'Greece', 'Poland', 'Belgium',
       'Argentina', 'Germany', 'Russian Federation', 'Indonesia',
       'Ireland', 'France', 'Ukraine', 'Denmark', 'Dominican Republic',
       'China', 'Latvia', 'Algeria', 'Colombia', 'Japan', 'Finland',
       'Romania', 'Brazil', 'Bulgaria', 'Iran, Islamic Republic of...',
       'Nepal', 'Bangladesh', 'Pakistan', 'Canada', 'Jordan', 'Portugal',
       'Italy', 'New Zealand', 'Turkey', 'Czech Republic', 'Viet Nam',
       'Austria', 'Egypt', 'Malaysia', 'Mozambique', 'Thailand',
       'Slovakia', 'Lebanon', 'Mexico', 'Hong Kong (S.A.R.)', 'Norway',
       'Myanmar', 'Switzerland', 'South Korea', 'Hungary', 'Armenia',
       'Kazakhstan', 'United Arab Emirates', 'Singapore', 'Qatar',
       'Bosnia and Herzegovina', 'Bahrain', 'Sri Lanka', 'Cambodia',
       'Serbia', 'Philippines', 'Peru', 'Botswana', 'Paraguay', 'Georgia',
       'Uruguay', 'Belarus', 'Lithuania', 'Afghanistan', 'Estonia',
       'Malta', 'Costa Rica', 'Ghana', 'Taiwan', 'Morocco', 'Albania',
       'Saudi Arabia', 'Slovenia', 'Uzbekistan', 'Republic of Korea',
       'El Salvador', 'Iceland', 'Venezuela, Bolivarian Republic of...',
       'Nicaragua', 'Other Country (Not Listed Above)', 'Tunisia',
       'The former Yugoslav Republic of Macedonia',
       'Micronesia, Federated States of...', 'Madagascar', 'Rwanda',
       'Yemen', 'Uganda', 'United Republic of Tanzania', 'Cameroon',
       'Cuba', 'Ethiopia', 'Oman', 'Ecuador', 'Angola',
       'Republic of Moldova', 'Honduras', 'Azerbaijan', 'Cyprus',
       'Bhutan', 'Guatemala', 'Syrian Arab Republic', 'Kuwait',
       'Luxembourg', 'Jamaica', 'Zimbabwe', 'San Marino', 'Fiji',
       'Liechtenstein', 'Burundi', 'Bolivia', 'Mauritius', 'Somalia',
       'Montenegro', 'Mongolia', 'Sudan', 'Maldives', 'Turkmenistan',
       'Panama', 'Barbados', 'Lesotho', 'Namibia', 'Gabon', 'Kyrgyzstan',
       'Swaziland', 'Antigua and Barbuda', 'Marshall Islands',
       'Trinidad and Tobago', 'Senegal', 'Iraq', 'Haiti', 'Malawi',
       'Benin', 'Libyan Arab Jamahiriya', 'Tajikistan',
       'Democratic Republic of the Congo', 'Andorra', 'Guinea',
       "Côte d'Ivoire", 'Bahamas', 'Central African Republic', 'Monaco',
       'Gambia', 'Sierra Leone', 'Togo', 'Palau', 'Zambia', 'Grenada',
       'Burkina Faso', 'Belize', 'Congo, Republic of the...', 'Suriname',
       'Timor-Leste', 'Dominica', 'Solomon Islands', 'Saint Lucia',
       'Niger', 'Guyana', 'Nauru', 'Mauritania', 'Mali', 'Liberia',
       'Brunei Darussalam', 'North Korea', 'Cape Verde', 'Eritrea',
       "Democratic People's Republic of Korea", 'Djibouti', nan,
       'Guinea-Bissau'], dtype=object)

In [27]:
surveys.Country.nunique()

183

In [29]:
len(surveys.Country.unique())

184

In [31]:
duplicatesKeepFirst = surveys.Country.duplicated(keep='first')

In [33]:
surveys[~duplicatesKeepFirst]

                                     Country OperatingSystem  Gender
0                                      Kenya     Linux-based    Male
1                             United Kingdom     Linux-based    Male
2                              United States             NaN     NaN
4                               South Africa         Windows    Male
7                                    Nigeria         Windows  Female
...                                      ...             ...     ...
86051                                Eritrea     Linux-based    Male
89738  Democratic People's Republic of Korea             NaN     NaN
92028                               Djibouti             NaN     NaN
93487                                    NaN             NaN     NaN
96975                          Guinea-Bissau             NaN     NaN

[184 rows x 3 columns]

In [34]:
len(surveys[~duplicatesKeepFirst])

184

In [35]:
surveys.drop_duplicates(subset=['Country', 'OperatingSystem'
])

                                  Country OperatingSystem Gender
0                                   Kenya     Linux-based   Male
1                          United Kingdom     Linux-based   Male
2                           United States             NaN    NaN
3                           United States         Windows   Male
4                            South Africa         Windows   Male
...                                   ...             ...    ...
97024                       Côte d'Ivoire             NaN    NaN
97155  Micronesia, Federated States of...             NaN    NaN
97420                             Liberia             NaN    NaN
97726                                Fiji             NaN    NaN
98254                          Cape Verde             NaN    NaN

[669 rows x 3 columns]

In [36]:
cou_opsys = surveys.drop_duplicates(subset=['Country', 'OperatingSystem'
])

In [37]:
cou_opsys[cou_opsys.Country == 'Poland']

      Country OperatingSystem Gender
30     Poland     Linux-based   Male
34     Poland         Windows   Male
232    Poland             NaN    NaN
854    Poland           MacOS   Male
72587  Poland        BSD/Unix    NaN